namespace ProjMan.Playground;

/// <summary>
/// Определяет текущее состояние жизненного цикла инженерного проекта.
/// </summary>
public enum ProjectStatus
{
    /// <summary>
    /// Проект используется для предварительных расчётов.
    /// Полная информация и назначение ответственных не обязательны.
    /// </summary>
    Draft,

    /// <summary>
    /// Проект находится на стадии подготовки тендерного предложения.
    /// Тендерная информация заполнена, ответственные назначены.
    /// </summary>
    Tender,

    /// <summary>
    /// Проект находится на стадии реализации.
    /// Результаты тендерных расчётов зафиксированы и недоступны для изменения.
    /// Добавляется логика сравнения расчетов стадии тендера и реализации.
    /// </summary>
    Realization,

    /// <summary>
    /// Работа над проектом завершена.
    /// Данные доступны для просмотра и копирования, но не для изменения.
    /// </summary>
    Completed
}